first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 2], ["created_at", "2023-02-16 20:25:17.574682"], ["updated_at", "2023-02-16 20:25:17.574682"]]
---
  def create
    @artworkshare = ArtworkShare.new(share_params)
    if @artworkshare.save