first_routes_and_controllers/app/controllers/artworks_controller.rb

  def index
    @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def create
    @artwork = Artwork.new(artwork_params)
    if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "feet"], ["image_url", "5"], ["artist_id", 4], ["created_at", "2023-02-16 20:27:13.969250"], ["updated_at", "2023-02-16 20:27:13.969250"]]