first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: User.find(params[:id])

INSERT INTO "users" ("name", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "\"Gary\""], ["created_at", "2023-02-15 21:47:12.392407"], ["updated_at", "2023-02-15 21:47:12.392407"], ["email", "\"gary@gmail.com\""]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "\"Shan\""], ["updated_at", "2023-02-15 21:50:23.789768"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        @user = User.find(params[:id])

        if @user.destroy