first_routes_and_controllers/app/models/artwork.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def self.artworks_for_user_id(user_id)
    user = User.find(user_id)